<template>
	<view>
		<view class="article">
			<view class="title">{{currentPost.postTitle}}</view>
			<view class="user">
				<uni-row>
					<uni-col :span="4"><image class="avatar" :src="currentPost.author.authorAvator" mode="aspectFit"></image></uni-col>
					<uni-col :span="10">
						<text class="nick">{{currentPost.author.authorNick}}</text>
					</uni-col>
					<uni-col :span="10">
						<text class="time">{{currentPost.postTime}}</text>
					</uni-col>
				</uni-row>
				
			</view>
			<view class="contentview">
				<image :src="currentPost.postImg"></image>
				<text class="content">
					{{currentPost.postContent}}
				</text>
			</view>
		</view>
	</view>
</template>

<script>
	export default {
		onLoad:function(arg) {
			console.log(arg.id)
			this.currentPost = this.post[arg.id-1]
		},
		data() {
			return {
				post: [{
						postId: 1,
						postTitle: '老年人该如何养生？老年人养生的16个知识',
						postImg: 'https://t12.baidu.com/it/u=441778271,2733593680&fm=173&app=25&f=JPEG?w=640&h=454&s=D8AA67D8D0233CBCF01D655A0300C0D2',
						postContent: "随着我国老龄化速度的加快，老龄人口数量不断增多，老年人的健康成了居民幸福指数的晴雨表。老年人是社会的弱势群体，老年人的数量也在逐年增长，为了提高他们的自我保健意识，今天小编为大家讲解一下老年人如何养生。那么老年人该如何养生呢？ 老年人该如何养生？老年人养生的16个知识。\n1.老年人养生知识之生活有规律，动静结合。运动多以太极拳，老年操为主！不要做过分剧烈的运动，应减轻心脏负担！当然，也不要整日的躺在床上休息，可以多到外面走一走，晒晒太阳，下下象棋等等。\n2.老年人养生知识之定期体检。随着年龄的增长，身体机能会有一定的衰减。所以，应该定期去体检，根据体检结果及时做出相应的调整或者采取有效的行动措施！\n3.老年人养生知识之夏季养生。如能适应夏季气候，正确调养，人们就可以使机体积蓄充足的阳气，从而提高人体的抵抗能力，为适应冬季的严寒气候做好准备。夏季暑气逼人，老人应注意避暑，不宜过于贪凉。老人要经常洗澡，以使皮肤疏松，体内的阳热之气得以发泄，同时炎热气候下要调息静心，避免发怒。\n4.老年人养生知识之用药要科学合理。老年人用药要科学合理，恰到好处，能祛病益寿，否则会给身体带来不必要的损害。老年人用药时应：避免盲目用药，有些药能吃，有些药就要少吃，针对自己的情况进行增减，尤其是一些补药，不然的话会适得其反，引发很多不必要的麻烦。\n5.老年人养生知识之秋季养生。秋季养生最重要的就是润燥了，润燥的食物有，百合、银耳、芝麻、核桃、甘蔗、牛奶都不失为润燥最好的选择，但是由于每个人的身体体质是不一样的，所以还需要辩证解燥。\n6.老年人养生知识之要积极锻炼身体。生命在于运动，随着年龄的增长，就更需要进行锻炼了。对于老年人来说，可以到公园散散步，慢跑等运动量不宜过大锻炼，还可以练习太极拳、放风筝以及跟朋友一块下棋保持身心的健康愉快。\n7.老年人养生知识之养阳：阳气为生命之本，保护好阳气就是保护自己的生命。养成温水，温食，不食生冷；温水洗手、洗澡，换季多添衣服，夏天少吹空调的好习惯，避免受凉。每晚泡脚是个非常好的习惯。\n8.老年人养生知识之老年人要丰富饮食物种类。食量减少，营养失衡，很多疾病也会乘虚而入。丰富饮食种类，每天吃12种以上食物；延长烹调时间，让饭菜更软烂，易消化；饮食尽量色彩丰富，增加老年人的食欲。\n9.老年人养生知识之方法借助睡眠。睡眠与人体免疫力密切相关。良好的睡眠可使体内的两种淋巴细胞数量，明显上升。睡眠时人体产生一种称为胞壁酸的睡眠因子，促使白血球增多，巨噬细胞活跃，肝脏解毒功能增强，从而将侵入的细菌和病毒消灭。\n10.老年人养生知识之保护肠胃。老年人需要特别注意保护自己的肠胃健康。在生活中，不要吃过硬不易消化的产品，这样很容易诱发肠胃炎症，降低抵抗力；需要吃比较熟软的食物；需要喝温开水；需要常吃粗粮；需要定时排便。\n11.老年人养生知识之限制饮酒。老年人每天饮低度白酒不要超过100毫升，黄酒不要超过250毫开，啤酒不要超过1瓶，因为酒精对人体的每部分都会产生消极影响。即使喝葡葡酒可以降低胆固醇，也应该限制每天一杯，过量饮用会给血液与心脏等器官造成很大破坏。\n12.老年人养生知识之便秘。便秘是中气不足造成的，尤其是老年人， 情况可能更多， 由于食肉过多用餐过快欢夜酗酒情绪紧张，运动过少等原因，导致便秘的老年人不断增加。老年人便秘，怎么办？建议调整作息时间，早睡早起，清淡饮食，多吃富含租纤维的食物，多饮水，多运动，少些辛辣!帮助胃肠运动，很有效!\n13.老年人养生知识之要少饮浓茶。老年人饮浓茶会引起很多副作用：比如胃液稀释，不能正常消化；阻碍人体对铁的吸收；导致便秘症等，所以老年人要养生，就要少饮浓茶。\n14.老年人养生知识之冬季养生知识。老年人冬季养生主要指通过饮食、睡眠、运动、药物等手段，达到延年益寿的目的。\n15.老年人养生知识之防寒先防足。老年人的皮肤萎缩，保暖功能下降，造成“身为脚先凉”的后果。如果老年人脚掌受凉，便可引发感冒和其他疾病。所以冬季重视老人足部的保暖御寒。老人每晚睡前可以用热水泡脚并适当按摩。独睡的老人，脚部最好放一只热水袋或预先温热，并适当扎紧，防止热能散发。\n16.老年人养生知识之不能随意进补。老年人要根据自己身体的实际状况，来确定是否需用滋补药。补药并不是所有人都适官，不该补的补了，反而增加机体的代谢排泄负担。如果只是为了强壮身体，那么可以通过日常饮食来摄取营养。体质过虚的切忌随意大补，否则“虚不受补”，反而补出乱子来。\n老年人该如何养生？老年人养生的16个知识。老年人在日常生活中需要多观察自己身体状况，遵循早发现、早预防、早治疗的健康原则，这样才能使大家更好遵循良好的生活方式、远离疾病。在这里还要提醒老年朋友:要正确对待养生，关注自己的健康，在日常生活中，要注意合理的饮食结构和运动，调试好自己的心情，安排好家庭生活，注意个人卫生，并且要做定期检查。",
						postTime: '2020-10-12 18:46',
						author: {
							authorNick: '人生大事养身体',
							authorAvator: 'https://pic.rmb.bdstatic.com/813dfaf96c16f7159123dccde56fd45a.jpeg?x-bce-process=image/resize,m_lfit,w_200,h_200&autime=9746',
						},
					},

				],
				currentPost: ''
			}
		},
		methods: {

		}
	}
</script>

<style>
	.title {
		width: 90%;
		margin: auto;
		font-size: 40rpx;
		font-weight: bold;
		margin-top: 25rpx;
		margin-bottom: 20rpx;
	}
	.avatar{
		height: 80rpx;
		width: 80rpx;
		margin-left: 30rpx;
		margin-top: 10rpx;
	}
	.nick{
		font-size: 35rpx;
		font-weight: bold;
		height: 100rpx;
		line-height: 100rpx;
	}
	.time{
		height: 100rpx;
		line-height: 100rpx;
	}
	.contentview{
		width: 90%;
		margin: auto;
		margin-top: 20rpx;
		
	}
	.content{
		font-size: 30rpx;
		margin-left: 30rpx;
	}
</style>
